export default {
  'GET /api/getDoc': {
    data: [
      {
        data: [
          {
            title: '标题',
            level: 1,
            description: '这是文档1的介绍内容',
            children: [
              {
                title: '小标题1',
                level: 2,
                description: '这是正文111111111',
                img: '@/assets/yay.jpg',
              },
              {
                title: '小标题2',
                description: '这是正文22222222222',
              },
            ],
          },
        ],
        title: '文档1',
      },
      {
        data: [
          {
            title: '标题',
            level: 1,
            description: '这是文档21的介绍内容',
            children: [
              {
                title: '小标题1',
                level: 2,
                description: '这是正文111111111',
              },
              {
                title: '小标题2',
                level: 2,
                description: '这是正文22222222222',
              },
            ],
          },
        ],
        title: '文档2.1',
      },
      {
        data: [
          {
            title: '标题',
            level: 1,
            description: '这是文档22的介绍内容',
            children: [
              {
                title: '小标题1',
                level: 2,
                description: '这是正文111111111',
                img: '@/assets/yay.jpg',
              },
              {
                title: '小标题2',
                level: 2,
                description:
                  '这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221s这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221s这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221这是正文222222222221s',
              },
            ],
          },
        ],
        title: '文档2.2',
      },
    ],
    title: '仓库1',
  },
};
